# **Space X  Falcon 9 First Stage Landing Prediction**

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only **private company** ever to **return a spacecraft from low-earth orbit**, which it first accomplished in December 2010.
SpaceX advertises **Falcon 9** rocket launches on its website with a cost of $\$62M$ wheras other providers cost upward of 165 million dollars each.\
Much of the savings is because Space X can **reuse the first stage**. 

Therefore if we can **determine if the first stage will land**, we can determine the cost of a launch. 

This information can be used if an alternate company wants to **bid against SpaceX** for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [87]:
# !pip install sqlalchemy==1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [88]:
#Please uncomment and execute the code below if you are working locally.

#!pip install ipython-sql

In [89]:
# for data manipulation
import csv
import pandas as pd
# for working with sql database
import sqlite3

In [90]:
# create connection object
    ## create database named `my_data1.db`
con = sqlite3.connect("my_data1.db")
# create cursor object to execute sql queries
cur = con.cursor()

In [91]:
# Activate SQL Magic for Jupyter Notebook
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [92]:
# local file storage path
file_local = r"D:\IBM Professional Certification\10_Data Science Capstone Project\3_EDA with SQL\data\Spacex.csv"

In [93]:
# load dataset
df = pd.read_csv(file_local)

# Load DataFrame contents into `my_data1.db` database as a Table
    ## Table name -> `SPACEXTBL`
    ## if table with same name exists in DB already then will drop it before inserting any new data
    ## Table will NOT have index column (dataframe does not either)
    ## Multiple values will be passed in single SQL INSERT statement
df.to_sql(name="SPACEXTBL", con=con,
          if_exists="replace", index=False,
          method="multi")

101

In [94]:
# Establish connection between
# SQL Magic module & SQL server for the database
%sql sqlite:///my_data1.db

#### NOTE:
```python
101 ## output of above `df.to_sql(...)`
```
1. Total `101` rows were read into SQL table from the dataframe.

In [95]:
df.isnull().sum(axis=0)

Date                 0
Time (UTC)           0
Booster_Version      0
Launch_Site          0
Payload              0
PAYLOAD_MASS__KG_    0
Orbit                0
Customer             0
Mission_Outcome      0
Landing_Outcome      0
dtype: int64

**Note:This below code is added to remove blank rows from table**

In [96]:
%%sql

-- retrieve rows which are not blank

CREATE TABLE IF NOT EXISTS SPACEXTABLE AS
SELECT * FROM SPACEXTABLE
WHERE `Date` IS NOT NULL;

 * sqlite:///my_data1.db
Done.

[]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [97]:
%%sql

SELECT DISTINCT `Launch_Site` AS
`Unique Launch sites`
FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [98]:
%%sql

SELECT *
FROM SPACEXTABLE
WHERE
`Launch_Site` LIKE 'CCA%'
LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [99]:
%%sql

SELECT
Customer,
SUM(PAYLOAD_MASS__KG_) AS `Total Payload mass (kg)`
FROM SPACEXTABLE
WHERE Customer LIKE '%CRS%'
GROUP BY `Customer`;

 * sqlite:///my_data1.db
Done.

[('NASA (CRS)', 45596), ('NASA (CRS), Kacific 1', 2617)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [100]:
%%sql

SELECT
Booster_Version AS `Booster Version`,
AVG(PAYLOAD_MASS__KG_) AS `Average Payload mass (kg)`
FROM SPACEXTABLE
WHERE `Booster_Version` REGEXP '^F9 v1.1'
GROUP BY `Booster_Version`;

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 2928.4),
 ('F9 v1.1  B1003', 500.0),
 ('F9 v1.1 B1010', 2216.0),
 ('F9 v1.1 B1011', 4428.0),
 ('F9 v1.1 B1012', 2395.0),
 ('F9 v1.1 B1013', 570.0),
 ('F9 v1.1 B1014', 4159.0),
 ('F9 v1.1 B1015', 1898.0),
 ('F9 v1.1 B1016', 4707.0),
 ('F9 v1.1 B1017', 553.0),
 ('F9 v1.1 B1018', 1952.0)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [101]:
%%sql

SELECT
MIN(`DATE`) AS `First Successful Landing `,
`Landing_Outcome`
FROM SPACEXTABLE
WHERE `Landing_Outcome` REGEXP '^Success';

 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [102]:
%%sql

SELECT
Booster_Version AS `Booster`,
PAYLOAD_MASS__KG_ AS `Payload Mass (kg)`,
Landing_Outcome AS `Landing Outcome`
FROM SPACEXTABLE
WHERE
Landing_Outcome REGEXP '^Success\s*\S*drone\s*\S*'
AND
PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 4696, 'Success (drone ship)'),
 ('F9 FT B1026', 4600, 'Success (drone ship)'),
 ('F9 FT  B1021.2', 5300, 'Success (drone ship)'),
 ('F9 FT  B1031.2', 5200, 'Success (drone ship)')]

>Alternative to above solution (Task 6) using `LIKE` operator.
```python
%%sql

SELECT
Booster_Version, Landing_Outcome
FROM SPACEXTABLE
WHERE
Landing_Outcome LIKE '%Success%drone%'
AND
PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000;
```

### Task 7




##### List the total number of successful and failure mission outcomes

In [103]:
%%sql

SELECT
Mission_Outcome AS `Mission Outcome`,
COUNT(Mission_Outcome) AS `Total`
FROM SPACEXTABLE
GROUP BY Mission_Outcome;

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [106]:
%%sql

SELECT
Booster_Version AS `Booster`,
PAYLOAD_MASS__KG_ AS `Maximum Payload Mass (kg)`
FROM SPACEXTABLE
WHERE
PAYLOAD_MASS__KG_ = (
                    SELECT MAX(PAYLOAD_MASS__KG_)
                    FROM SPACEXTABLE
                    );

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [112]:
%%sql

SELECT
SUBSTR(Date, 6, 2) AS `Month`,
SUBSTR(Date, 1, 4) AS `Year`,
Landing_Outcome AS `Landing Outcome`,
Booster_Version AS `Booster`,
Launch_Site AS `Launch Site`
FROM SPACEXTABLE
WHERE
Landing_Outcome REGEXP '\s*\S*[f|F]ailure\s*\S*[d|D]rone\s*\S*'
AND
SUBSTR(Date, 1, 4) = '2015';

 * sqlite:///my_data1.db
Done.

[('01', '2015', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', '2015', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [131]:
%%sql

SELECT

Date AS `Date`,
Landing_Outcome AS `Landing Outcome`,
COUNT(Landing_Outcome) AS `Total Outcome`,
RANK() OVER (ORDER BY COUNT(Landing_Outcome) DESC) AS `Rank`

FROM SPACEXTABLE

WHERE
CAST(SUBSTR(Date, 1, 4) AS INT) BETWEEN 2010 AND 2017
AND
CAST(SUBSTR(Date, 6, 2) AS INT) IN (6, 7, 8, 9, 10, 11, 12, 1, 2, 3)
AND
CAST(SUBSTR(Date, 9, 2) AS INT) BETWEEN 4 AND 20

GROUP BY Landing_Outcome

ORDER BY `Total Outcome` DESC;

 * sqlite:///my_data1.db
Done.

[('2012-10-08', 'No attempt', 6, 1),
 ('2016-07-18', 'Success (ground pad)', 5, 2),
 ('2016-08-14', 'Success (drone ship)', 4, 3),
 ('2015-01-10', 'Failure (drone ship)', 4, 3),
 ('2010-06-04', 'Failure (parachute)', 2, 5),
 ('2014-07-14', 'Controlled (ocean)', 2, 5)]